Phanxv/Microcontroller/STM32L152rb/Lab101/Lab101_EXTI/Project/src/main.c
#include "stm32l1xx.h"
#include "stm32l1xx_ll_system.h"
#include "stm32l1xx_ll_rcc.h"
#include "stm32l1xx_ll_gpio.h"
#include "stm32l1xx_ll_pwr.h"
#include "stm32l1xx_ll_utils.h"
#include "stm32l1xx_ll_bus.h"

void SystemClock_Config(void);
int flag = 0;

int main(){
		//Setup GPIO
    RCC->AHBENR |= (3<<0);
    GPIOA->MODER &= ~(3<<0);
		GPIOB->MODER |= (5<<12);
		//Setup Interrupt
    RCC->APB2ENR |= (1<<0);
    SYSCFG->EXTICR[0] &= ~(15<<0);
    EXTI->IMR |= (1<<0);
    EXTI->FTSR |= (1<<0);

    NVIC_EnableIRQ((IRQn_Type) 6);
	  NVIC_SetPriority((IRQn_Type) 6, 0);
		
		GPIOB->ODR &=  ~(1<<6); 
		GPIOB->ODR &=  ~(1<<7); 
	  while(1);
}

void EXTI0_IRQHandler(void){
	if (EXTI->PR & (1<<0)) 
		{                                                 
			if(flag==0){
				GPIOB->ODR |=  (1<<6); 
				GPIOB->ODR &=  ~(1<<7);
				flag = 1;
			}
			else{
				GPIOB->ODR &=  ~(1<<6); 
				GPIOB->ODR |=  (1<<7);
				flag = 0;
			}
			EXTI->PR |= (1<<0);
		}
}

void SystemClock_Config(void)
{
  /* Enable ACC64 access and set FLASH latency */ 
  LL_FLASH_Enable64bitAccess();; 
  LL_FLASH_SetLatency(LL_FLASH_LATENCY_1);

  /* Set Voltage scale1 as MCU will run at 32MHz */
  LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_PWR);
  LL_PWR_SetRegulVoltageScaling(LL_PWR_REGU_VOLTAGE_SCALE1);
  
  /* Poll VOSF bit of in PWR_CSR. Wait until it is reset to 0 */
  while (LL_PWR_IsActiveFlag_VOSF() != 0)
  {
  };
  
  /* Enable HSI if not already activated*/
  if (LL_RCC_HSI_IsReady() == 0)
  {
    /* HSI configuration and activation */
    LL_RCC_HSI_Enable();
    while(LL_RCC_HSI_IsReady() != 1)
    {
    };
  }
  
	
  /* Main PLL configuration and activation */
  LL_RCC_PLL_ConfigDomain_SYS(LL_RCC_PLLSOURCE_HSI, LL_RCC_PLL_MUL_6, LL_RCC_PLL_DIV_3);

  LL_RCC_PLL_Enable();
  while(LL_RCC_PLL_IsReady() != 1)
  {
  };
  
  /* Sysclk activation on the main PLL */
  LL_RCC_SetAHBPrescaler(LL_RCC_SYSCLK_DIV_1);
  LL_RCC_SetSysClkSource(LL_RCC_SYS_CLKSOURCE_PLL);
  while(LL_RCC_GetSysClkSource() != LL_RCC_SYS_CLKSOURCE_STATUS_PLL)
  {
  };
  
  /* Set APB1 & APB2 prescaler*/
  LL_RCC_SetAPB1Prescaler(LL_RCC_APB1_DIV_1);
  LL_RCC_SetAPB2Prescaler(LL_RCC_APB2_DIV_1);

  /* Set systick to 1ms in using frequency set to 32MHz                             */
  /* This frequency can be calculated through LL RCC macro                          */
  /* ex: __LL_RCC_CALC_PLLCLK_FREQ (HSI_VALUE, LL_RCC_PLL_MUL_6, LL_RCC_PLL_DIV_3); */
  LL_Init1msTick(32000000);
  
  /* Update CMSIS variable (which can be updated also through SystemCoreClockUpdate function) */
  LL_SetSystemCoreClock(32000000);
}
